
 //**************************************************************************//
 // Данный исходный код является составной частью системы МВТУ-4             //
 // Программист:        Никишин Е.В.                                        //
 //**************************************************************************//


unit fmu_texts;

interface

const

  {$IFNDEF ENG}

  txtCom_er_Unzip       = 'Ошибка распаковки модели FMU';

  {$ELSE}

  txtCom_er_Unzip       = 'Unzip FMU file is failed';

  {$ENDIF}

implementation

end.
