
 //**************************************************************************//
 // Данный исходный код является составной частью системы МВТУ-4             //
 // Программист:        Тимофеев К.А.                                        //
 //**************************************************************************//


library fmuwrapper_lib;

  //**************************************************************************//
  //              Библиотека блоков сетевого обмена                           //
  //     Автор: Тимофеев К.А., март 2005 г.                                   //
  //**************************************************************************//

uses
  simmm,
  Classes,
  Blocks in 'Blocks.pas',
  Info in 'Info.pas',
  fmu_texts in 'fmu_texts.pas',
  FMUWrapperLibrary in 'FMUWrapperLibrary.pas';

{$R *.res}

  //Эта функция возвращает адрес структуры DllInfo
function  GetEntry:Pointer;
begin
  Result:=@DllInfo;
end;

exports
  GetEntry name 'GetEntry',         //Функция получения адреса структуры DllInfo
  CreateObject name 'CreateObject'; //Функция создания объекта

begin
end.
